In [1]:
import pandas as pd
import numpy as np
import collections
import seaborn as sns
%matplotlib inline
from matplotlib import pyplot as plt
import matplotlib.ticker as ticker

result = pd.read_csv('data/loto.csv', sep=";")

In [4]:
result.sample(10)

            DATA  BOLA 1  BOLA 2  BOLA 3  BOLA 4  BOLA 5  BOLA 6
775   31/03/2012       9      11      21      49      53      54
1224  12/12/2007      19      23      26      31      33      36
1330  02/12/2006       4      29      33      36      38      42
1476  22/06/2005      24      25      30      42      43      50
249   11/02/2017       2       7       9      18      21      25
647   19/06/2013       2      10      12      30      41      42
365   02/02/2016       2       6       8      21      25      34
220   17/05/2017       2       8       9      15      22      34
1706  15/03/2003       7      20      31      32      50      53
792   01/02/2012       6      10      12      17      28      53

In [5]:
print(result["BOLA 1"].mean(),result["BOLA 2"].mean(),result["BOLA 3"].mean(),result["BOLA 4"].mean(),
      result["BOLA 5"].mean(),result["BOLA 6"].mean())

8.595536959553696 17.220362622036262 26.1906090190609 34.96373779637378 43.54997675499767 52.23570432357043

In [6]:
def dealTime(s):
    return "/".join(s.split("/")[1:])

result.DATA = result.DATA.apply(dealTime)

In [7]:
# result.DATA = pd.to_datetime(result.DATA)

In [8]:
result.head()

      DATA  BOLA 1  BOLA 2  BOLA 3  BOLA 4  BOLA 5  BOLA 6
0  05/2019       2      14      18      29      36      38
1  05/2019      23      24      26      38      42      49
2  05/2019      21      23      37      44      46      48
3  05/2019       8      15      32      33      58      59
4  05/2019      17      19      37      41      42      49

In [11]:
dt1 = result.groupby("DATA").mean()

In [14]:
dt1.head()

         BOLA 1  BOLA 2  BOLA 3  BOLA 4  BOLA 5  BOLA 6
DATA
01/1997    6.25   22.00   28.75   37.25   47.75   54.50
01/1998    8.25   14.00   25.25   35.25   44.00   54.25
01/1999    6.75   20.75   26.25   38.00   50.50   54.25
01/2000   14.25   23.50   33.50   40.00   45.50   55.25
01/2001    7.50   14.00   22.75   30.75   38.00   54.75